# Part 54

# Import Module

In [2]:
import pandas as pd

# Persiapan Data Frame

In [3]:
data = {
    "nama":["bayu","indra","devi","agni"],
    "jenis_kelamin":["L","L","P","L"],
    "usia":[23,21,22,25]
}

df = pd.DataFrame(data)
df

    nama jenis_kelamin  usia
0   bayu             L    23
1  indra             L    21
2   devi             P    22
3   agni             L    25

# Menyimpan Data Frame Sebagai file csv

In [4]:
df.to_csv('data_peserta.csv')

In [8]:
# df = pd.read_csv('data_peserta.csv')
df = pd.read_csv('data_peserta.csv',index_col=0)
df

    nama jenis_kelamin  usia
0   bayu             L    23
1  indra             L    21
2   devi             P    22
3   agni             L    25

In [9]:
df.to_csv('data_peserta.csv',index=False)
df = pd.read_csv('data_peserta.csv')
df

    nama jenis_kelamin  usia
0   bayu             L    23
1  indra             L    21
2   devi             P    22
3   agni             L    25